<!-- 
※ 현재 페이지 참고사항

1. 작성된 리뷰를 보는 페이지, 리뷰기능의 메인페이지에 해당
2. 작성일, 좋아요 정렬
3. 국가별 필터링

-->

<template>
    <transition name="fade">
        <v-content grid-list-md text-xs-center>
            <v-layout>
                <v-spacer></v-spacer>
                <!-- 리뷰 작성 버튼 -->
                <v-flex xs10 sm10>
                    <v-btn outline color="red lighten-2" to="writeReview" block>리뷰 작성</v-btn>
                </v-flex>
                <v-spacer></v-spacer>
            <!-- SNS 공유 -->
            </v-layout>
            <v-layout align-center>
                <v-spacer></v-spacer>
                <v-flex xs10 sm10>
                    <social-sharing v-bind:url= "url" inline-template>
                        <v-layout>
                            <v-spacer></v-spacer>
                            <v-flex xs4 sm2 offset-xs1>
                                <network network="facebook">
                                    <!-- facebook svg태그 -->
                                    <svg viewBox="0 0 448 512" width="70%" height="70%">
                                        <path style="fill:#3b5998;" d="M448 56.7v398.5c0 13.7-11.1 
                                        24.7-24.7 24.7H309.1V306.5h58.2l8.7-67.6h-67v-43.2c0-19.6 
                                        5.4-32.9 33.5-32.9h35.8v-60.5c-6.2-.8-27.4-2.7-52.2-2.7-51.6 
                                        0-87 31.5-87 89.4v49.9h-58.4v67.6h58.4V480H24.7C11.1 480 0 
                                        468.9 0 455.3V56.7C0 43.1 11.1 32 24.7 32h398.5c13.7 0 24.8 
                                        11.1 24.8 24.7z"/>
                                    </svg>
                                </network>
                            </v-flex>
                            <v-flex xs4 sm2 align-content-center>
                                <network network="twitter">
                                    <!-- twitter svg태그 -->
                                    <svg viewBox="0 0 512 512" width="70%" height="70%">
                                        <path style="fill:#00aced;" d="M459.37 151.716c.325 4.548.325 9.097.325 13.645 0 138.72-105.583 
                                        298.558-298.558 298.558-59.452 0-114.68-17.219-161.137-47.106 8.447.974 
                                        16.568 1.299 25.34 1.299 49.055 0 94.213-16.568 
                                        130.274-44.832-46.132-.975-84.792-31.188-98.112-72.772 6.498.974 
                                        12.995 1.624 19.818 1.624 9.421 0 18.843-1.3 
                                        27.614-3.573-48.081-9.747-84.143-51.98-84.143-102.985v-1.299c13.969 7.797 
                                        30.214 12.67 47.431 13.319-28.264-18.843-46.781-51.005-46.781-87.391 0-19.492 
                                        5.197-37.36 14.294-52.954 51.655 63.675 129.3 105.258 
                                        216.365 109.807-1.624-7.797-2.599-15.918-2.599-24.04 
                                        0-57.828 46.782-104.934 104.934-104.934 30.213 0 57.502 12.67 76.67 33.137 
                                        23.715-4.548 46.456-13.32 66.599-25.34-7.798 24.366-24.366 44.833-46.132 
                                        57.827 21.117-2.273 41.584-8.122 60.426-16.243-14.292 20.791-32.161 
                                        39.308-52.628 54.253z"/>
                                    </svg>
                                </network>                                
                            </v-flex>
                            <v-flex xs4 sm2 justify-center>
                                <network network="weibo">
                                    <!-- weibo svg태그 -->
                                    <svg version="1.1" width="70%" height="70%" id="Layer_1" x="0px" y="0px" 
                                    viewBox="0 0 512 512" style="enable-background:new 0 0 512 512;" xml:space="preserve">
                                        <path style="fill:#EA533B;" d="M403.51,247.992c12.189-23.721,13.499-45.899,3.546-63.137
                                            c-10.316-17.868-31.605-28.033-59.944-28.622c-20.81-0.427-44.439,4.311-68.131,13.528c8.166-27.851,5.532-49.961-7.876-63.369
                                            c-16.113-16.113-44.899-16.666-81.056-1.558c-33.715,14.088-70.764,40.33-104.325,73.889
                                            c-49.982,49.983-83.19,107.958-84.779,147.93C0.318,330.616,0,334.579,0,338.441c0,35.793,25.09,69.017,70.648,93.547
                                            c43.858,23.617,101.979,36.622,163.656,36.622s119.798-13.005,163.656-36.622c45.558-24.53,70.648-57.754,70.648-93.547
                                            C468.609,304.067,445.576,272.184,403.51,247.992z"/>
                                        <path style="fill:#D93C1C;" d="M260.338,459.932c-61.677,0-119.798-13.005-163.656-36.622
                                            c-45.558-24.53-70.648-57.754-70.648-93.547c0-3.863,0.318-7.825,0.945-11.787c1.589-39.973,34.797-97.947,84.78-147.93
                                            c33.227-33.226,69.87-59.27,103.314-73.458c-7.854,1.823-16.218,4.566-25.023,8.245c-33.715,14.088-70.764,40.33-104.325,73.889
                                            C35.742,228.707,2.534,286.682,0.945,326.654C0.318,330.616,0,334.579,0,338.441c0,35.793,25.09,69.017,70.648,93.547
                                            c43.858,23.617,101.979,36.622,163.656,36.622c48.616,0,95.016-8.086,133.969-23.074
                                            C335.352,454.941,298.529,459.932,260.338,459.932z"/>
                                        <path style="fill:#FFFFFF;" d="M364.19,312.032c-2.568-29.565-22.081-55.61-54.944-73.338
                                            c-31.681-17.091-72.302-24.49-114.382-20.835c-42.079,3.656-80.818,17.949-109.076,40.247
                                            c-29.314,23.131-44.045,52.151-41.476,81.715c2.569,29.565,22.082,55.61,54.946,73.338c26.389,14.236,58.976,21.748,93.447,21.747
                                            c6.913,0,13.905-0.302,20.934-0.913c42.079-3.654,80.817-17.948,109.075-40.246C352.029,370.616,366.758,341.596,364.19,312.032z"/>
                                        <path style="fill:#E5E5E5;" d="M230.36,425.319c-7.029,0.611-14.021,0.913-20.934,0.913c-34.471,0.001-67.059-7.511-93.447-21.747
                                            c-32.863-17.729-52.378-43.774-54.946-73.338c-2.569-29.564,12.161-58.584,41.476-81.715c5.799-4.575,12.046-8.808,18.665-12.687
                                            c-12.993,5.932-24.911,13.095-35.388,21.361c-29.314,23.131-44.045,52.151-41.476,81.715c2.569,29.565,22.082,55.61,54.946,73.338
                                            c26.389,14.236,58.976,21.748,93.447,21.747c6.913,0,13.905-0.302,20.934-0.913c33.445-2.905,64.771-12.535,90.41-27.559
                                            C281.994,416.503,256.841,423.019,230.36,425.319z"/>
                                        <path style="fill:#333333;" d="M286.65,312.533c-9.507-39.544-55.55-62.508-102.638-51.189
                                            c-47.088,11.32-77.661,52.703-68.156,92.249c4.682,19.473,18.156,35.492,37.943,45.105c12.283,5.967,26.102,9.003,40.355,9.003
                                            c8.042,0,16.221-0.967,24.339-2.918C265.582,393.462,296.157,352.08,286.65,312.533z"/>
                                        <circle style="fill:#FFFFFF;" cx="177.898" cy="351.457" r="30.373"/>
                                        <g>
                                            <path style="fill:#FFA929;" d="M373.152,117.153c-7.189,0-13.017,5.828-13.017,13.017c0,7.189,5.828,13.017,13.017,13.017
                                                c26.318,0,47.729,21.411,47.729,47.729c0,7.189,5.828,13.017,13.017,13.017s13.017-5.828,13.017-13.017
                                                C446.914,150.243,413.824,117.153,373.152,117.153z"/>
                                            <path style="fill:#FFA929;" d="M364.475,43.39c-3.261,0-6.564,0.108-9.817,0.322c-9.564,0.629-16.808,8.893-16.18,18.458
                                                c0.629,9.564,8.9,16.804,18.458,16.18c2.498-0.164,5.035-0.248,7.539-0.248c62.206,0,112.813,50.608,112.813,112.813
                                                c0,7.606-0.759,15.204-2.257,22.581c-1.396,6.875,1.691,14.209,7.576,18.025c5.99,3.884,14.111,3.587,19.829-0.675
                                                c3.388-2.525,5.774-6.307,6.614-10.445c1.958-9.646,2.95-19.566,2.95-29.487C512,109.571,445.82,43.39,364.475,43.39z"/>
                                        </g>
                                        <circle style="fill:#FFFFFF;" cx="234.305" cy="321.085" r="17.356"/>
                                    </svg>
                                </network>
                            </v-flex>
                            <v-spacer></v-spacer>
                        </v-layout>         
                    </social-sharing>
                </v-flex>
                <v-spacer></v-spacer>
            </v-layout>
            <!-- 구분 -->
            <br><br>
            <v-layout>
                <v-flex xs4 sm2 offset-sm1 offset-xs1>
                    <!-- 정렬 기준 선택 -->
                    <v-select 
                    :items      ="sortItems" 
                    v-model     ="sortSelect" 
                    label       ="정렬" 
                    item-text   ="sort" 
                    item-value  ="sortNum" 
                    single-line 
                    return-object>
                    </v-select> 
                </v-flex>
                <v-flex xs4 sm2>
                    <!-- 국가 필터링 기준 선택 -->
                    <v-select 
                    :items      ="filterItems" 
                    v-model     ="filterSelect" 
                    label       ="국가 선택"  
                    item-text   ="country"
                    single-line
                    return-object>
                    </v-select> 
                </v-flex>
                <v-spacer></v-spacer>
            </v-layout>
            <br><br>
            <v-layout>
                <v-flex>
                    <!-- 리뷰 내용 출력 -->
                    <UserReviewData 
                    :countryNum     ="this.filterSelect.countryNum" 
                    :countryName    ="this.filterSelect.country" 
                    :sortNum        ="this.sortSelect.sortNum">
                    </UserReviewData>
                </v-flex>
            </v-layout>
        </v-content>
    </transition>
</template>

<script>
// 리뷰 데이터를 전달받아 생성하고 정렬하는 컴퍼넌트 import
import UserReviewData from './UserReviewData';

// axios 라이브러리 import
import VueAxios from 'vue-axios';
import axios    from 'axios';

export default {
    components : {
        'UserReviewData' : UserReviewData,
    },

    data() {
        return {
            url         : "",             // 리뷰를 하는 페이지 URL
            sortSelect  : { sort: '작성일순', sortNum: 1 },     // 선택된 정렬 기준
            sortItems   : [                                     // 정렬 기준들
                { sort: '작성일순', sortNum: 1 },
                { sort: '좋아요순',   sortNum: 2 },
            ],

            filterSelect    : { country: '국가 선택', countryNum: 0 },          // 선택된 국가 필터링 기준
            filterItems     : [                                 // 국가 필터링 기준들
                { country: 'all',   countryNum: 0 },
                { country: 'china', countryNum: 1 },
                { country: 'japan', countryNum: 2 },
                { country: 'korea', countryNum: 3 },
                { country: 'USA',   countryNum: 4 },
            ]
        }
    },

    methods:{
        
    },

    created() {
        // url 주소를 현재 페이지로 url로 변경합니다.
        this.url = window.location.href;
    }
}
</script>

<style>
    /* svg태그의 cursor를 설정합니다. */
    svg {
        cursor: pointer;
    }
    
    .fade-enter-active, .fade-leave-active {
        transition: opacity .5s
    }
    .fade-enter, .fade-leave-active {
        opacity: 0
    }
</style>